package reports_used_car

var Reports = make(map[string]Report)

var AccidentsByVINs = map[string]DatedList{
	"123456": {
		{Date: "2020-01-01", Item: "Наезд на препятствие"},
		{Date: "2023-01-01", Item: "Столкновение с другим ТС"},
	},
	"234567": {
		{Date: "2022-05-01", Item: "Наезд на препятствие"},
	},
	"345678": {
		{Date: "2019-01-01", Item: "Столкновение с другим ТС"},
		{Date: "2022-04-01", Item: "ДТП с тремя участниками"},
	},
}

var LimitsWantedInfoByVINs = map[string]string{
	"123456": "Нет ограничений, не в розыске",
	"234567": "Нет ограничений, не в розыске",
	"345678": "Ограничение регистрационных действий, не в розыске",
}

var OwnershipHistoryByVINs = map[string]DatedList{
	"123456": {
		{Date: "2020-01-01", Item: "Иванов Анатолий Степанович"},
		{Date: "2023-01-01", Item: "Петров Евгений Сергеевич"},
	},
	"234567": {
		{Date: "2022-05-01", Item: "Сидоров Александр Иванович"},
	},
	"345678": {
		{Date: "2019-01-01", Item: "Баранов Степан Петрович"},
		{Date: "2022-04-01", Item: "Крылов Олег Александрович"},
	},
}
